#include <stdio.h>


int main() {

	int selected_drink = 0;
	int drink_quantity[3] = { 0 };


	while (1) {

		printf("\n┌────────────────────────────────────────┐\n");
		printf("│             음료수 자판기              │\n");
		printf("├────────────────────────────────────────┤\n");
		printf("│  [1] 커피 : 1500원   [2] 우유 : 1000원 │\n");
		printf("│  [3] 콜라 :  500원   [0] 주문 마침     │\n");
		printf("└────────────────────────────────────────┘\n");

		while (1) {
			printf("\n------------------------------------------\n");
			printf(">> 음료수를 선택해주세요 : ");
			scanf_s("%d", &selected_drink);

			if (selected_drink == 0) break;
			if (selected_drink == -1) return 0;

			if (selected_drink >= 1 && selected_drink <= 3) {
				int qty = 0;
				printf(">> 개수를 선택해주세요 : ");
				scanf_s("%d", &qty);
				drink_quantity[selected_drink - 1] += qty;
			}
			else {
				printf("! 번호를 잘못 입력하셨습니다. 다시 입력해주세요 !");
			}
		}
		printf("\n==========================================\n");
		printf("        선택한 음료수 주문 내역\n");
		printf("==========================================\n");

		char* drink_name[] = { "커피","우유","콜라" };
		int drink_price[] = { 1500, 1000, 500 };
		int total_price = 0;

		for (int b = 0; b < 3; b++) {
			if (drink_quantity[b] > 0) {
				int total2 = drink_price[b] * drink_quantity[b];
				printf("%-10s | %5d원 | %2d개 | : %7d원\n", drink_name[b], drink_price[b], drink_quantity[b], total2);
				total_price += total2;
			}
		}
		printf("------------------------------------------\n");
		printf("총 합계 금액 : %22d원\n", total_price);
		printf("==========================================\n");

	}
	return 0;
}
